In [1]:
import pandas as pd

In [20]:
professions = pd.read_csv('./data/Prestige.csv')
professions.head()

                  name  education  income  women  prestige  census  type
0   gov.administrators      13.11   12351  11.16      68.8    1113  prof
1     general.managers      12.26   25879   4.02      69.1    1130  prof
2          accountants      12.77    9271  15.70      63.4    1171  prof
3  purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4             chemists      14.62    8403  11.68      73.5    2111  prof

In [21]:
dict = {'name': 'data scientist','education': 'NaN','income':'NaN','women':'NaN',
       'prestige':'NaN','census':'NaN','type':'NaN'}

In [22]:
professions = professions.append(dict,ignore_index=True)

C:\Users\mykas\AppData\Local\Temp\ipykernel_10328\3766678728.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  professions = professions.append(dict,ignore_index=True)

In [23]:
professions.tail()

               name education income  women prestige census type
98     taxi.drivers      7.93   4224   3.59     25.1   9173   bc
99     longshoremen      8.37   4753    0.0     26.1   9313   bc
100     typesetters      10.0   6462  13.58     42.2   9511   bc
101     bookbinders      8.55   3617  70.87     35.2   9517   bc
102  data scientist       NaN    NaN    NaN      NaN    NaN  NaN

In [24]:
taxi = professions[professions['name'] == 'taxi.drivers']

In [25]:
professions.drop(index=98,inplace=True)

In [26]:
professions.tail()

               name education income  women prestige census type
97      bus.drivers      7.58   5562   9.47     35.9   9171   bc
99     longshoremen      8.37   4753    0.0     26.1   9313   bc
100     typesetters      10.0   6462  13.58     42.2   9511   bc
101     bookbinders      8.55   3617  70.87     35.2   9517   bc
102  data scientist       NaN    NaN    NaN      NaN    NaN  NaN

In [27]:
taxi

            name education income women prestige census type
98  taxi.drivers      7.93   4224  3.59     25.1   9173   bc

In [ ]:
professions.append(taxi)